USE ssafydb;

----------------------------------------------------------
-- 숫자 관련 함수 
----------------------------------------------------------

# ROUND(number, [i] ) 


# TRUNCATE(number, i) 



# ceil(n) , floor(n)



# mod(n1, n2)



----------------------------------------------------------
-- 문자 관련 함수 
----------------------------------------------------------

# lower(), upper()



# concat() 



# substr()



# left(), right(), mid() 



# instr() 



# 메일주소에서 id부분만 추출하기
# ssafy13@example.com, javalove@ssafy.com



# 메일주소에서 @이후부분만 추출하기
# ssafy13@example.com, javalove@ssafy.com


# length(), char_length()



# lpad(), rpad()



# ltrim(), rtrim(), trim() 



----------------------------------------------------------
-- 날짜 관련 함수  
----------------------------------------------------------

# sysdate() , now()



# CURDATE() , CURTIME()



# DATE_ADD(date, INTERVAL value xx),  DATE_SUB(date, INTERVAL value xx) 



# DATEDIFF(), TIMESTAMPDIFF()



# date(),year(),month(),day()



----------------------------------------------------------
-- 변환 함수
----------------------------------------------------------

# STR_TO_DATE()



# CAST()



# FORMAT()



# DATE_FORMAT()



----------------------------------------------------------
-- 기타 함수
----------------------------------------------------------

# if()
# 사원의 월급여가 3000이상이면 A등급,아니면 B



# 사원의 월급여가 4000이상이면 A등급,3000이상이면 B등급, 아니면  C등급



# 000101-3010224 주민번호에서 성별 알아내기(IF 함수 활용)




# coalesce(), ifnull()
# 사원의 이름,월급여, 커미션, 1년급여+커미션 조회(단, comm이 정해지지 않았으면 0으로 처리)



